src/extensions/ПоддержкаПереходаКСопоставленнымОбъектам/InformationRegisters/НастройкиТранспортаОбменаДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиТранспортаОбменаДанными</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>COMИмяИнформационнойБазыНаСервере1СПредприятия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMИмяСервера1СПредприятия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Корреспондент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/extensions/ПоддержкаПереходаКСопоставленнымОбъектам/CommonModules/ППСО_ОбменДаннымиВызовСервера/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Получить реквизиты подключения к узлу информационной базы
//   изм регистра НастройкиТранспортаОбменаДанными
//
// Параметры:
//  УзелИнформационнойБазы	 - ПланОбменаСсылка	 - узел информационной базы, для которого
//    необходимо получить реквизиты подключения
// 
// Возвращаемое значение:
//   Структура - структура, содержащая реквизиты подключения к информационной базе
//     (ИмяСервера, ИмяИнформационнойБазы)
//
Функция ПолучитьРеквизитыПодключенияКУзлуИнформационнойБазы(УзелИнформационнойБазы) Экспорт
	Контекст = "ППСО_ОбменДаннымиВызовСервера.ПолучитьРеквизитыПодключенияКУзлуИнформационнойБазы";

	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		Контекст,
		"УзелИнформационнойБазы",
		УзелИнформационнойБазы,
		ПланыОбмена.ТипВсеСсылки());
	
	// Запрос для получения реквизитов подключения к узлу информационной базы
	ЗапросРеквизитовПодключения = Новый Запрос;
	ЗапросРеквизитовПодключения.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиТранспортаОбменаДанными.COMИмяСервера1СПредприятия КАК ИмяСервера,
		|	НастройкиТранспортаОбменаДанными.COMИмяИнформационнойБазыНаСервере1СПредприятия КАК ИмяИнформационнойБазы
		|ИЗ
		|	РегистрСведений.НастройкиТранспортаОбменаДанными КАК НастройкиТранспортаОбменаДанными
		|ГДЕ
		|	НастройкиТранспортаОбменаДанными.Корреспондент = &УзелИнформационнойБазы
		|";
	//

	ЗапросРеквизитовПодключения.УстановитьПараметр("УзелИнформационнойБазы", УзелИнформационнойБазы);
	РезультатЗапроса = ЗапросРеквизитовПодключения.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не обнаружены реквизиты подключения к узлу информационной базы ""%2"".
				|(в регистре НастройкиТранспортаОбмена).
				|Переход к сопоставленному объекту невозможен.
				|
				|Контекст ""%1""'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			Контекст,
			Строка(УзелИнформационнойБазы.Наименование));
		ЗаписьЖурналаРегистрации("Переход к сопоставленному объекту. Поиск реквизитов подключения к ИБ",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.НайтиПоТипу(ТипЗнч(УзелИнформационнойБазы)), УзелИнформационнойБазы,
			ТекстСообщения);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;

	РеквзитыПодключения = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	Возврат РеквзитыПодключения;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
